Documents/ПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.БезналичнаяОплата</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступленияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПризнакиОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПризнакиОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолностьюОплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаписьКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	Плательщик = Объект.Плательщик;
	ВидОперации = Объект.ВидОперации;
	ТипДенежныхСредств = Объект.ТипДенежныхСредств;
	
	Если Объект.Ссылка.Пустая() ТОГДА
		Объект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
		Объект.Касса = Справочники.Кассы.ЦентральнаяКасса;
	КонецЕсли;
КонецПроцедуры    

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьВидимость() 
 	СтрокаТипПлательщика = "";	
 	Если Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
 		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;  
		Элементы.Касса.Видимость = Истина; 
	ИначеЕсли Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
		Элементы.Касса.Видимость = Ложь; 
		Элементы.ЭквайринговыйТерминал.Видимость = Истина;
	КонецЕсли;

	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь; 
		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
		Элементы.Касса.Видимость = Истина; 
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.КассаИсточник.Видимость = Ложь;
		Элементы.Плательщик.Видимость = Истина;
		СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке")Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь; 
		Элементы.Касса.Видимость = Истина; 
		Элементы.РасчетныйСчет.Видимость = Истина; 
		Элементы.КассаИсточник.Видимость = Ложь; 
		Элементы.Плательщик.Видимость = Истина;
		СтрокаТипПлательщика = "СправочникСсылка.Банки";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПоступлениеИзДругойКассы") Тогда
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
		Элементы.РасчетныйСчет.Видимость = Ложь; 
		Элементы.Плательщик.Видимость = Ложь;
		Элементы.Касса.Видимость = Истина;
		Элементы.КассаИсточник.Видимость = Истина; 
	Иначе		
		Элементы.ДоговорКонтрагента.Видимость = Истина; 
		Элементы.РасчетныйСчет.Видимость = Ложь;
		Элементы.КассаИсточник.Видимость = Ложь;   
		Элементы.Плательщик.Видимость = Истина;
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда         
        Массив = Новый Массив();
        Массив.Добавить(Тип(СтрокаТипПлательщика));    
        ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);
        Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;        
	КонецЕсли; 
	
	Если Элементы.ДоговорКонтрагента.Видимость = Истина
        И ЗначениеЗаполнено(Объект.Плательщик) Тогда
        Элементы.ДоговорКонтрагента.Видимость = ВидимостьДоговораКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
    КонецЕсли; 	
   КонецПроцедуры


&НаКлиенте
Процедура ТипДенежныхСредствПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	Если Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные")
	И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ЭквайринговыйТерминал");
		ТекстВопроса = "При изменении реквизита ""Тип оплаты"" на "+ Строка(Объект.ТипДенежныхСредств)+" будут очищены следующие данные:
		| - Эквайринговый терминал
		| Продолжить?";  
	ИначеЕсли Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные")
	И ЗначениеЗаполнено(Объект.Касса) Тогда
		МассивОчищаемыхРеквизитов.Добавить("Касса");
		ТекстВопроса = "При изменении реквизита ""Тип оплаты"" на "+ Строка(Объект.ТипДенежныхСредств)+" будут очищены следующие данные:
		| - Касса
		| Продолжить?"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов)Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииТипаденежныхСредств",ЭтаФорма,МассивОчищаемыхреквизитов);
		ПоказатьВопрос (Оповещение, ТекстВопроса,РежимДиалогаВопрос.ДаНет,,,"Внимание!");
	Иначе 
		ТипДенежныхСредств = Объект.ТипДенежныхСредств;
		УстановитьВидимость();  
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииТипаДенежныхСредств(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
    	Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        	Объект[Реквизит] = Неопределено;
    	КонецЦикла;
    	УстановитьВидимость();
    	ТипДенежныхСредств =  Объект.ТипДенежныхСредств;
	Иначе
   		Объект.ТипДенежныхСредств = ТипДенежныхСредств;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника")
	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке"))
	И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		ТекстВопроса = "При изменении реквизита ""Вид операции"" на " + Строка(Объект.ВидОперации) + " будут очищены следующие данные:
		| - Договор контрагента
		| Продолжить?"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов)Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОпераций",ЭтаФорма,МассивОчищаемыхРеквизитов);
		ПоказатьВопрос (Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!"); 
	Иначе 
		ВидОперации = Объект.ВидОперации;
		УстановитьВидимость();  
	КонецЕсли;
КонецПроцедуры   
&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииВидаОпераций(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
    	Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        	Объект[Реквизит] = Неопределено;
    	КонецЦикла;
    	УстановитьВидимость();
    	ВидОперации =  Объект.ВидОперации;
	Иначе
   		Объект.ВидОперации = ВидОперации;
	КонецЕсли;
КонецПроцедуры    

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент) 
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	ЭтоПоставщик = ВидимостьДоговораКонтрагента.ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
	МассивОчищаемыхРеквизитов = Новый Массив;
	Если Не ЭтоПоставщик И Значениезаполнено(Объект.ДоговорКонтрагента) Тогда
		МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
		ТекстВопроса = "При изменении реквизита ""Плательщик"" на " + Строка(Объект.Плательщик) + " будут очищены следующие данные:
		| - Договор контрагента
		| Продолжить?"; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов)Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПлательщика",ЭтаФорма,МассивОчищаемыхРеквизитов);
		ПоказатьВопрос (Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!"); 
	Иначе 
		Плательщик = Объект.Плательщик;
		УстановитьВидимость();  
	КонецЕсли;  
	УстановитьВидимость();
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииПлательщика(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
    	Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        	Объект[Реквизит] = Неопределено;
    	КонецЦикла;
    	УстановитьВидимость();
    	Плательщик =  Объект.Плательщик;
	Иначе
   		Объект.Плательщик = Плательщик;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьРеквизитыФормы();
	Если Параметры.Свойство("Основание")  
	И ЗначениеЗаполнено(Параметры.Основание)
	И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		СтруктураОплаты = Документы.РеализацияТоваровИУслуг.ПроверитьОплатуДокумента(Параметры.Основание);
		ПризнакОплаты = СтруктураОплаты.ПризнакОплаты;
		Если ПризнакОплаты = Перечисления.ПризнакиОплаты.ПолностьюОплачен Тогда
			СообщениеПользователю = Новый СообщениеПользователю();
			СообщениеПользователю.Текст = "Данный документ уже полностью оплачен.Ввод дополнительного документа оплаты не требуется!";
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			возврат;
		Иначе 
			Объект.СуммаДокумента = СтруктураОплаты.ОсталосьОплатить;
			ОсталосьОплатить = СтруктураОплаты.ОсталосьОплатить;
		КонецЕсли;
	КонецЕсли;   
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный)Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 			
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Если ОсталосьОплатить > 0 
	И Объект.СуммаДокумента > ОсталосьОплатить Тогда
		Объект.СуммаДокумента = ОсталосьОплатить;
	КонецЕсли;
КонецПроцедуры
